{
  "version": "1.8.1", 
  "nickname": "AFN", 
  "outputs": [
    [
      {
        "access": "None", 
        "name": "report", 
        "description": "...", 
        "type": null, 
        "default": null
      }, 
      {
        "access": "None", 
        "name": "model", 
        "description": "The input Honeybee Model for which the Airflow network has\nbeen set up.", 
        "type": null, 
        "default": null
      }
    ]
  ], 
  "inputs": [
    {
      "access": "item", 
      "name": "_model", 
      "description": "A Honeybee Model for which the Airflow network will be set up.\nThis Model should have everything assigned to it that is needed\nfor simulation, including solved adjacencies and relevant window-\nopening properties.", 
      "type": "System.Object", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "leakage_template_", 
      "description": "Text identifying the leakiness of the Model, which is used\nto generate AFNCrack objects that represent infiltration for\neach of the Model's surfaces (Face, Aperture, and Door).\n_\nChoose from the following.\n* Excellent\n* Medium\n* VeryPoor\n_\nThese three text values correspond to DesignBuilder's Cracks\nTemplates, which provide typical crack flow coefficients and\nexponents for different envelope tightness classifications.\n_\nIf None, the exterior airflow leakage parameters will be derived\nfrom the room infiltration rate specified in the room's energy\nproperties, which are in units of m3/s per m2 of facade. This\nderivation from the Room's infiltration will compute air leakage\nparameters for exterior cracks that produce a total air flow rate\nequivalent to the room's infiltration rate at an envelope pressure\ndifference of 4 Pa. This default derivation is not as complete of a\nrepresentation of building airflow dynamics as the DesignBuilder\nCrack Templates are. However, since the airflow leakage parameters are\nderived from values in m3/s-m2 of infiltration, they are easier to\nrelate to the results of infiltration blower-door tests, which\ntypically express infiltration rates in these units.", 
      "type": "string", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "_delta_pressure_", 
      "description": "The air pressure difference across the building envelope in\nPascals, which is used to calculate infiltration crack flow\ncoefficients when no leakage template is specified. The resulting\naverage simulated air pressure difference will roughly equal this\ndelta pressure times the nth root of the ratio between the simulated\nand target room infiltration rates. (Default: 4).", 
      "type": "double", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "_ref_pressure_", 
      "description": "The reference barometric pressure measurement in Pascals\nunder which the surface crack data were obtained. (Default: 101325).", 
      "type": "double", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "_high_rise_", 
      "description": "Boolean indicating whether the Model is LowRise or HighRise.\nThis parameter is used to estimate building-wide wind pressure\ncoefficients for the AFN by approximating the building geometry\nas an extruded rectangle. LowRise corresponds to a building where\nthe height is less then three times the width AND length of the\nfootprint. HighRise corresponds to a building where height is more\nthan three times the width OR length of the footprint. If None,\nthis property will be auto-calculated from Room geometry of the\nModel. This default assumption may not be appropriate if the Model\nrepresents only a portion of a larger Building.", 
      "type": "bool", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "_long_axis_", 
      "description": "A number between 0 and 180 for the clockwise angle difference\nin degrees that the long axis of the building is from true North.\nThis parameter is used to estimate building-wide wind pressure\ncoefficients for the AFN by approximating the building geometry\nas an extruded rectangle. 0 indicates a North-South long axis while\n90 indicates an East-West long axis. If None, this property will be\nauto-calculated from Room geometry of the Model (either 0 or 90).\nThis default assumption may not be appropriate if the Model\nrepresents only a portion of a larger Building.", 
      "type": "double", 
      "default": null
    }, 
    {
      "access": "item", 
      "name": "_aspect_ratio_", 
      "description": "A number between 0 and 1 for the aspect ratio of the building's\nfootprint, defined as the ratio of length of the short axis divided\nby the length of the long axis. This parameter is used to estimate\nbuilding-wide wind pressure coefficients for the AFN by approximating\nthe building geometry as an extruded rectangle If None, this\nproperty will be auto-calculated from Room geometry of the Model\nand the _long_axis_ above. This default assumption may not be\nappropriate if the Model represents only a portion of a larger\nbuilding.", 
      "type": "double", 
      "default": null
    }
  ], 
  "subcategory": "3 :: Loads", 
  "code": "\nimport math\ntry:\n    from ladybug_geometry.geometry3d.pointvector import Vector3D\nexcept ImportError as e:\n    raise ImportError('\\nFailed to import ladybug_geometry:\\n\\t{}'.format(e))\n\ntry:\n    from honeybee_energy.ventcool.afn import generate\nexcept ImportError as e:\n    raise ImportError('\\nFailed to import honeybee_energy:\\n\\t{}'.format(e))\n\ntry:\n    from ladybug_{{cad}}.{{plugin}} import all_required_inputs, give_warning\nexcept ImportError as e:\n    raise ImportError('\\nFailed to import ladybug_{{cad}}:\\n\\t{}'.format(e))\n\nleakage_tempaltes = {\n    'excellent': 'Excellent',\n    'medium': 'Medium',\n    'verypoor': 'VeryPoor'\n}\n\n\nif all_required_inputs(ghenv.Component):\n    # duplicate the input Model to avoid editing it\n    model = _model.duplicate()\n\n    # set default properties for the leakage if they are not input\n    try:\n        leakage = leakage_tempaltes[leakage_template_.lower()] \\\n            if leakage_template_ is not None else 'Medium'\n    except KeyError:\n        raise TypeError('leakage_template_ \"{}\" is not recognized. Choose from: '\n                        'Excellent, Medium VeryPoor'.format(leakage_template_))\n    use_room_infiltration = True if leakage_template_ is None else False\n    pressure = _ref_pressure_ if _ref_pressure_ is not None else 101325\n    delta_pressure = _delta_pressure_ if _delta_pressure_ is not None else 4\n\n    # check for operable exterior apertures that are horizontal as E+ cannot simulate these\n    up_vec, horiz_aps = Vector3D(0, 0, 1), []\n    for ap in model.apertures:\n        if ap.is_operable:\n            ang = math.degrees(ap.normal.angle(up_vec))\n            if ang < 10 or ang > 170:\n                ap.is_operable = False\n                horiz_aps.append(ap.identifier)\n    if len(horiz_aps) != 0:\n        msg = 'The following exterior operable apertures are within 10 degrees of ' \\\n            'being horizontal.\\nThese cannot be simulated in EnergyPlus and so they ' \\\n            'have been set to be inoperable:\\n{}'.format('\\n'.join(horiz_aps))\n        print(msg)\n        give_warning(ghenv.Component, msg)\n\n    # generate the AFN leakage for all of the surfaces of the Model\n    generate(model.rooms, leakage, use_room_infiltration, pressure, delta_pressure)\n\n    # set up the Model-wide VentilationSimulationParameters for the AFN\n    vent_sim_par = model.properties.energy.ventilation_simulation_control\n    vent_sim_par.vent_control_type = 'MultiZoneWithoutDistribution'\n    if _long_axis_ is not None:  # assing this first so it's in the autocalculation\n        vent_sim_par.long_axis_angle = _long_axis_\n    model.properties.energy.autocalculate_ventilation_simulation_control()\n\n    # set the properties used to approximate wind pressure coefficients\n    if _high_rise_ is not None:\n        vent_sim_par.building_type = 'HighRise' if _high_rise_ else 'LowRise'\n    if _aspect_ratio_ is not None:\n        vent_sim_par.aspect_ratio = _aspect_ratio_\n        vent_sim_par.long_axis_angle = _long_axis_\n    report = model.properties.energy.ventilation_simulation_control\n", 
  "category": "HB-Energy", 
  "name": "HB Airflow Newtwork", 
  "description": "Set up a Honeybee Model to use the EnergyPlus Airflow Network (AFN) for all airflow\nin the energy simulation.\n_\nCompared to the default single-zone methods that Honeybee uses for infiltration\nand ventilation, the AFN represents air flow in a manner that is truer to the fluid\ndynamic behavior of real buildings. In particular, the AFN more accurately models\nthe flow of air from one zone to another, accounting for the pressure changes\ninduced by wind and air density differences. However, using the AFN means that\nthe simulation will take considerably longer to run compared to the single zone\noption and the difference in simulation results is only likely to be significant\nwhen the Model contains operable windows or the building is extremely leaky.\n_\nPassing a Honeybee Model through this component before energy simulation will\nresult in the following changes to the EnergyPlus IDF:\n_\n1. All ZoneInfiltration objects will be excluded and, instead, infiltration will\nbe modeled with AFN Crack objects assigned to each opaque Face.\n_\n2. For all AirBoundary Faces within the Model, ZoneMixing objects will be excluded\nand, instead, the air boundary will be modeled with AFN Crack objects that have\nvery large pressure coefficients derived from the orifice equation and the area\nof the air wall.\n_\n3. For all operable Apertures, ZoneVentilation:WindandStackOpenArea objects will\nbe excluded and, instead, these operable apertures will be modeled with AFN\nSimpleOpening objects.\n_\n4. For each Room with a VentilationControl object to specify setpoints at which\nthe windows open, an Energy Management System (EMS) program will be written to\ndictate when the operable Apertures of the Room open.\n-"
}